; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v2 - type_3 ?v5 - type_2)
 	      (pred_4 ?v3 - object ?v5 - type_2)
	      (pred_1 ?v2 - type_3 ?v8 - type_1)
	      (pred_3 ?v2 - type_3 ?v3 - object ?v8 - type_1))

   (:action op_2
       :parameters  (?v2 - type_3 ?v6 ?v1 - type_2)
       :precondition (and  (pred_2 ?v2 ?v6))
       :effect (and  (pred_2 ?v2 ?v1)
		     (not (pred_2 ?v2 ?v6))))

   (:action op_3
       :parameters (?v2 - type_3 ?v7 - object ?v4 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v4) (pred_2 ?v2 ?v4) (pred_1 ?v2 ?v8))
       :effect (and (pred_3 ?v2 ?v7 ?v8)
		    (not (pred_4 ?v7 ?v4)) 
		    (not (pred_1 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_3 ?v7 - object ?v4 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v7 ?v8) (pred_2 ?v2 ?v4))
       :effect (and (pred_4 ?v7 ?v4)
		    (pred_1 ?v2 ?v8)
		    (not (pred_3 ?v2 ?v7 ?v8)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_05 obj_09 - type_1
obj_02 obj_03 obj_06 - type_2
obj_01 obj_04 obj_08 - object)
(:init
(pred_2 obj_07 obj_06)
(pred_1 obj_07 obj_05)
(pred_1 obj_07 obj_09)
(pred_4 obj_01 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_08 obj_03)
)
(:goal
(and
(pred_4 obj_01 obj_02)
(pred_4 obj_04 obj_02)
(pred_4 obj_08 obj_06)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_09))))
)
)

; plan
1. (op_2 obj_07 obj_06 obj_03)
   deleted: (pred_2 obj_07 obj_06)
   added: (pred_2 obj_07 obj_03)
   goals met: 2 of 3
2. (op_3 obj_07 obj_08 obj_03 obj_05)
   deleted: (pred_4 obj_08 obj_03) (pred_1 obj_07 obj_05)
   added: (pred_3 obj_07 obj_08 obj_05)
   goals met: 2 of 3
3. (op_2 obj_07 obj_03 obj_06)
   deleted: (pred_2 obj_07 obj_03)
   added: (pred_2 obj_07 obj_06)
   goals met: 2 of 3
4. (op_1 obj_07 obj_08 obj_06 obj_05)
   deleted: (pred_3 obj_07 obj_08 obj_05)
   added: (pred_4 obj_08 obj_06) (pred_1 obj_07 obj_05)
   goals met: 3 of 3
